{"char2id": {"<pad>": 0, "<bos>": 1, "<eos>": 2, " ": 3, "%": 4, "(": 5, ")": 6, ",": 7, "-": 8, ".": 9, "/": 10, ";": 11, "<": 12, ">": 13, "?": 14, "E": 15, "K": 16, "L": 17, "N": 18, "[": 19, "\\": 20, "]": 21, "a": 22, "i": 23, "j": 24, "m": 25, "o": 26, "r": 27, "s": 28, "u": 29, "v": 30, "{": 31, "~": 32, "·": 33, "ʹ": 34, "ʼ": 35, "ʽ": 36, "́": 37, "̂": 38, "̈": 39, "̊": 40, "̓": 41, "̔": 42, "̣": 43, "͂": 44, "͜": 45, "Ͱ": 46, "ͱ": 47, "Ͳ": 48, "ͳ": 49, "Ͷ": 50, "ͷ": 51, "΄": 52, "Ά": 53, "Έ": 54, "Ή": 55, "Ί": 56, "Ό": 57, "Ύ": 58, "Ώ": 59, "ΐ": 60, "Α": 61, "Β": 62, "Γ": 63, "Δ": 64, "Ε": 65, "Ζ": 66, "Η": 67, "Θ": 68, "Ι": 69, "Κ": 70, "Λ": 71, "Μ": 72, "Ν": 73, "Ξ": 74, "Ο": 75, "Π": 76, "Ρ": 77, "Σ": 78, "Τ": 79, "Υ": 80, "Φ": 81, "Χ": 82, "Ψ": 83, "Ω": 84, "ά": 85, "έ": 86, "ή": 87, "ί": 88, "ΰ": 89, "α": 90, "β": 91, "γ": 92, "δ": 93, "ε": 94, "ζ": 95, "η": 96, "θ": 97, "ι": 98, "κ": 99, "λ": 100, "μ": 101, "ν": 102, "ξ": 103, "ο": 104, "π": 105, "ρ": 106, "ς": 107, "σ": 108, "τ": 109, "υ": 110, "φ": 111, "χ": 112, "ψ": 113, "ω": 114, "ϊ": 115, "ϋ": 116, "ό": 117, "ύ": 118, "ώ": 119, "ϗ": 120, "Ϙ": 121, "ϙ": 122, "ϛ": 123, "Ϝ": 124, "ϝ": 125, "Ϟ": 126, "ϟ": 127, "Ϡ": 128, "ϡ": 129, "ϣ": 130, "ϫ": 131, "ϰ": 132, "ϲ": 133, "Ϲ": 134, "Ϻ": 135, "ϻ": 136, "ἀ": 137, "ἁ": 138, "ἂ": 139, "ἃ": 140, "ἄ": 141, "ἅ": 142, "ἆ": 143, "ἇ": 144, "Ἀ": 145, "Ἁ": 146, "Ἄ": 147, "Ἅ": 148, "Ἆ": 149, "Ἇ": 150, "ἐ": 151, "ἑ": 152, "ἒ": 153, "ἓ": 154, "ἔ": 155, "ἕ": 156, "Ἐ": 157, "Ἑ": 158, "Ἒ": 159, "Ἓ": 160, "Ἔ": 161, "Ἕ": 162, "ἠ": 163, "ἡ": 164, "ἢ": 165, "ἤ": 166, "ἥ": 167, "ἦ": 168, "ἧ": 169, "Ἠ": 170, "Ἡ": 171, "Ἢ": 172, "Ἤ": 173, "Ἥ": 174, "Ἦ": 175, "Ἧ": 176, "ἰ": 177, "ἱ": 178, "ἲ": 179, "ἴ": 180, "ἵ": 181, "ἶ": 182, "ἷ": 183, "Ἰ": 184, "Ἱ": 185, "Ἲ": 186, "Ἳ": 187, "Ἴ": 188, "Ἵ": 189, "Ἶ": 190, "Ἷ": 191, "ὀ": 192, "ὁ": 193, "ὂ": 194, "ὃ": 195, "ὄ": 196, "ὅ": 197, "Ὀ": 198, "Ὁ": 199, "Ὃ": 200, "Ὄ": 201, "Ὅ": 202, "ὐ": 203, "ὑ": 204, "ὒ": 205, "ὓ": 206, "ὔ": 207, "ὕ": 208, "ὖ": 209, "ὗ": 210, "Ὑ": 211, "Ὕ": 212, "ὠ": 213, "ὡ": 214, "ὢ": 215, "ὣ": 216, "ὤ": 217, "ὥ": 218, "ὦ": 219, "ὧ": 220, "Ὠ": 221, "Ὡ": 222, "Ὣ": 223, "Ὤ": 224, "Ὥ": 225, "Ὦ": 226, "Ὧ": 227, "ὰ": 228, "ὲ": 229, "ὴ": 230, "ὶ": 231, "ὸ": 232, "ὺ": 233, "ὼ": 234, "ᾀ": 235, "ᾁ": 236, "ᾄ": 237, "ᾅ": 238, "ᾆ": 239, "ᾇ": 240, "ᾈ": 241, "ᾍ": 242, "ᾐ": 243, "ᾑ": 244, "ᾔ": 245, "ᾕ": 246, "ᾖ": 247, "ᾗ": 248, "ᾠ": 249, "ᾤ": 250, "ᾦ": 251, "ᾧ": 252, "ᾨ": 253, "ᾳ": 254, "ᾴ": 255, "ᾶ": 256, "ᾷ": 257, "᾽": 258, "ῂ": 259, "ῃ": 260, "ῄ": 261, "ῆ": 262, "ῇ": 263, "῎": 264, "ῒ": 265, "ῖ": 266, "ῗ": 267, "ῢ": 268, "ῤ": 269, "ῥ": 270, "ῦ": 271, "ῧ": 272, "Ῥ": 273, "ῲ": 274, "ῳ": 275, "ῴ": 276, "ῶ": 277, "ῷ": 278, "῾": 279, "’": 280, "†": 281, "⟦": 282, "⟧": 283}, "id2char": {"0": "", "1": "", "2": "", "3": " ", "4": "%", "5": "(", "6": ")", "7": ",", "8": "-", "9": ".", "10": "/", "11": ";", "12": "<", "13": ">", "14": "?", "15": "E", "16": "K", "17": "L", "18": "N", "19": "[", "20": "\\", "21": "]", "22": "a", "23": "i", "24": "j", "25": "m", "26": "o", "27": "r", "28": "s", "29": "u", "30": "v", "31": "{", "32": "~", "33": "·", "34": "ʹ", "35": "ʼ", "36": "ʽ", "37": "́", "38": "̂", "39": "̈", "40": "̊", "41": "̓", "42": "̔", "43": "̣", "44": "͂", "45": "͜", "46": "Ͱ", "47": "ͱ", "48": "Ͳ", "49": "ͳ", "50": "Ͷ", "51": "ͷ", "52": "΄", "53": "Ά", "54": "Έ", "55": "Ή", "56": "Ί", "57": "Ό", "58": "Ύ", "59": "Ώ", "60": "ΐ", "61": "Α", "62": "Β", "63": "Γ", "64": "Δ", "65": "Ε", "66": "Ζ", "67": "Η", "68": "Θ", "69": "Ι", "70": "Κ", "71": "Λ", "72": "Μ", "73": "Ν", "74": "Ξ", "75": "Ο", "76": "Π", "77": "Ρ", "78": "Σ", "79": "Τ", "80": "Υ", "81": "Φ", "82": "Χ", "83": "Ψ", "84": "Ω", "85": "ά", "86": "έ", "87": "ή", "88": "ί", "89": "ΰ", "90": "α", "91": "β", "92": "γ", "93": "δ", "94": "ε", "95": "ζ", "96": "η", "97": "θ", "98": "ι", "99": "κ", "100": "λ", "101": "μ", "102": "ν", "103": "ξ", "104": "ο", "105": "π", "106": "ρ", "107": "ς", "108": "σ", "109": "τ", "110": "υ", "111": "φ", "112": "χ", "113": "ψ", "114": "ω", "115": "ϊ", "116": "ϋ", "117": "ό", "118": "ύ", "119": "ώ", "120": "ϗ", "121": "Ϙ", "122": "ϙ", "123": "ϛ", "124": "Ϝ", "125": "ϝ", "126": "Ϟ", "127": "ϟ", "128": "Ϡ", "129": "ϡ", "130": "ϣ", "131": "ϫ", "132": "ϰ", "133": "ϲ", "134": "Ϲ", "135": "Ϻ", "136": "ϻ", "137": "ἀ", "138": "ἁ", "139": "ἂ", "140": "ἃ", "141": "ἄ", "142": "ἅ", "143": "ἆ", "144": "ἇ", "145": "Ἀ", "146": "Ἁ", "147": "Ἄ", "148": "Ἅ", "149": "Ἆ", "150": "Ἇ", "151": "ἐ", "152": "ἑ", "153": "ἒ", "154": "ἓ", "155": "ἔ", "156": "ἕ", "157": "Ἐ", "158": "Ἑ", "159": "Ἒ", "160": "Ἓ", "161": "Ἔ", "162": "Ἕ", "163": "ἠ", "164": "ἡ", "165": "ἢ", "166": "ἤ", "167": "ἥ", "168": "ἦ", "169": "ἧ", "170": "Ἠ", "171": "Ἡ", "172": "Ἢ", "173": "Ἤ", "174": "Ἥ", "175": "Ἦ", "176": "Ἧ", "177": "ἰ", "178": "ἱ", "179": "ἲ", "180": "ἴ", "181": "ἵ", "182": "ἶ", "183": "ἷ", "184": "Ἰ", "185": "Ἱ", "186": "Ἲ", "187": "Ἳ", "188": "Ἴ", "189": "Ἵ", "190": "Ἶ", "191": "Ἷ", "192": "ὀ", "193": "ὁ", "194": "ὂ", "195": "ὃ", "196": "ὄ", "197": "ὅ", "198": "Ὀ", "199": "Ὁ", "200": "Ὃ", "201": "Ὄ", "202": "Ὅ", "203": "ὐ", "204": "ὑ", "205": "ὒ", "206": "ὓ", "207": "ὔ", "208": "ὕ", "209": "ὖ", "210": "ὗ", "211": "Ὑ", "212": "Ὕ", "213": "ὠ", "214": "ὡ", "215": "ὢ", "216": "ὣ", "217": "ὤ", "218": "ὥ", "219": "ὦ", "220": "ὧ", "221": "Ὠ", "222": "Ὡ", "223": "Ὣ", "224": "Ὤ", "225": "Ὥ", "226": "Ὦ", "227": "Ὧ", "228": "ὰ", "229": "ὲ", "230": "ὴ", "231": "ὶ", "232": "ὸ", "233": "ὺ", "234": "ὼ", "235": "ᾀ", "236": "ᾁ", "237": "ᾄ", "238": "ᾅ", "239": "ᾆ", "240": "ᾇ", "241": "ᾈ", "242": "ᾍ", "243": "ᾐ", "244": "ᾑ", "245": "ᾔ", "246": "ᾕ", "247": "ᾖ", "248": "ᾗ", "249": "ᾠ", "250": "ᾤ", "251": "ᾦ", "252": "ᾧ", "253": "ᾨ", "254": "ᾳ", "255": "ᾴ", "256": "ᾶ", "257": "ᾷ", "258": "᾽", "259": "ῂ", "260": "ῃ", "261": "ῄ", "262": "ῆ", "263": "ῇ", "264": "῎", "265": "ῒ", "266": "ῖ", "267": "ῗ", "268": "ῢ", "269": "ῤ", "270": "ῥ", "271": "ῦ", "272": "ῧ", "273": "Ῥ", "274": "ῲ", "275": "ῳ", "276": "ῴ", "277": "ῶ", "278": "ῷ", "279": "῾", "280": "’", "281": "†", "282": "⟦", "283": "⟧"}}