{"char2id": {"<pad>": 0, "<bos>": 1, "<eos>": 2, " ": 3, "#": 4, "$": 5, "%": 6, "&": 7, "(": 8, ")": 9, "*": 10, ",": 11, "-": 12, ".": 13, "/": 14, "0": 15, "1": 16, "2": 17, "3": 18, "4": 19, "5": 20, "6": 21, "7": 22, "8": 23, "9": 24, ";": 25, "<": 26, "=": 27, ">": 28, "?": 29, "A": 30, "D": 31, "E": 32, "F": 33, "G": 34, "I": 35, "K": 36, "P": 37, "R": 38, "S": 39, "V": 40, "[": 41, "\\": 42, "]": 43, "_": 44, "`": 45, "c": 46, "e": 47, "f": 48, "g": 49, "i": 50, "n": 51, "o": 52, "s": 53, "t": 54, "v": 55, "x": 56, "{": 57, "}": 58, "~": 59, "·": 60, "í": 61, "ó": 62, "ʹ": 63, "ʼ": 64, "ʽ": 65, "́": 66, "̂": 67, "̅": 68, "̈": 69, "̊": 70, "̌": 71, "̓": 72, "̔": 73, "̣": 74, "̸": 75, "͂": 76, "ͅ": 77, "͜": 78, "Ͱ": 79, "ͱ": 80, "Ͳ": 81, "ͳ": 82, "͵": 83, "Ͷ": 84, "ͷ": 85, "΄": 86, "Ά": 87, "Έ": 88, "Ή": 89, "Ί": 90, "Ό": 91, "Ύ": 92, "Ώ": 93, "ΐ": 94, "Α": 95, "Β": 96, "Γ": 97, "Δ": 98, "Ε": 99, "Ζ": 100, "Η": 101, "Θ": 102, "Ι": 103, "Κ": 104, "Λ": 105, "Μ": 106, "Ν": 107, "Ξ": 108, "Ο": 109, "Π": 110, "Ρ": 111, "Σ": 112, "Τ": 113, "Υ": 114, "Φ": 115, "Χ": 116, "Ψ": 117, "Ω": 118, "Ϊ": 119, "ά": 120, "έ": 121, "ή": 122, "ί": 123, "ΰ": 124, "α": 125, "β": 126, "γ": 127, "δ": 128, "ε": 129, "ζ": 130, "η": 131, "θ": 132, "ι": 133, "κ": 134, "λ": 135, "μ": 136, "ν": 137, "ξ": 138, "ο": 139, "π": 140, "ρ": 141, "ς": 142, "σ": 143, "τ": 144, "υ": 145, "φ": 146, "χ": 147, "ψ": 148, "ω": 149, "ϊ": 150, "ϋ": 151, "ό": 152, "ύ": 153, "ώ": 154, "Ϗ": 155, "ϐ": 156, "ϑ": 157, "ϖ": 158, "ϗ": 159, "Ϙ": 160, "ϙ": 161, "Ϛ": 162, "ϛ": 163, "Ϝ": 164, "ϝ": 165, "Ϟ": 166, "ϟ": 167, "Ϡ": 168, "ϡ": 169, "ϰ": 170, "ϲ": 171, "Ϲ": 172, "Ϻ": 173, "ϻ": 174, "Ͻ": 175, "ἀ": 176, "ἁ": 177, "ἂ": 178, "ἃ": 179, "ἄ": 180, "ἅ": 181, "ἆ": 182, "ἇ": 183, "Ἀ": 184, "Ἁ": 185, "Ἂ": 186, "Ἃ": 187, "Ἄ": 188, "Ἅ": 189, "Ἆ": 190, "Ἇ": 191, "ἐ": 192, "ἑ": 193, "ἒ": 194, "ἓ": 195, "ἔ": 196, "ἕ": 197, "Ἐ": 198, "Ἑ": 199, "Ἒ": 200, "Ἓ": 201, "Ἔ": 202, "Ἕ": 203, "ἠ": 204, "ἡ": 205, "ἢ": 206, "ἣ": 207, "ἤ": 208, "ἥ": 209, "ἦ": 210, "ἧ": 211, "Ἠ": 212, "Ἡ": 213, "Ἢ": 214, "Ἣ": 215, "Ἤ": 216, "Ἥ": 217, "Ἦ": 218, "Ἧ": 219, "ἰ": 220, "ἱ": 221, "ἲ": 222, "ἳ": 223, "ἴ": 224, "ἵ": 225, "ἶ": 226, "ἷ": 227, "Ἰ": 228, "Ἱ": 229, "Ἲ": 230, "Ἳ": 231, "Ἴ": 232, "Ἵ": 233, "Ἶ": 234, "Ἷ": 235, "ὀ": 236, "ὁ": 237, "ὂ": 238, "ὃ": 239, "ὄ": 240, "ὅ": 241, "Ὀ": 242, "Ὁ": 243, "Ὃ": 244, "Ὄ": 245, "Ὅ": 246, "ὐ": 247, "ὑ": 248, "ὒ": 249, "ὓ": 250, "ὔ": 251, "ὕ": 252, "ὖ": 253, "ὗ": 254, "Ὑ": 255, "Ὓ": 256, "Ὕ": 257, "Ὗ": 258, "ὠ": 259, "ὡ": 260, "ὢ": 261, "ὣ": 262, "ὤ": 263, "ὥ": 264, "ὦ": 265, "ὧ": 266, "Ὠ": 267, "Ὡ": 268, "Ὢ": 269, "Ὣ": 270, "Ὤ": 271, "Ὥ": 272, "Ὦ": 273, "Ὧ": 274, "ὰ": 275, "ὲ": 276, "ὴ": 277, "ὶ": 278, "ὸ": 279, "ὺ": 280, "ὼ": 281, "ᾀ": 282, "ᾁ": 283, "ᾂ": 284, "ᾃ": 285, "ᾄ": 286, "ᾅ": 287, "ᾆ": 288, "ᾇ": 289, "ᾈ": 290, "ᾉ": 291, "ᾌ": 292, "ᾍ": 293, "ᾎ": 294, "ᾐ": 295, "ᾑ": 296, "ᾒ": 297, "ᾓ": 298, "ᾔ": 299, "ᾕ": 300, "ᾖ": 301, "ᾗ": 302, "ᾘ": 303, "ᾙ": 304, "ᾜ": 305, "ᾞ": 306, "ᾟ": 307, "ᾠ": 308, "ᾡ": 309, "ᾣ": 310, "ᾤ": 311, "ᾥ": 312, "ᾦ": 313, "ᾧ": 314, "ᾨ": 315, "ᾬ": 316, "ᾯ": 317, "ᾱ": 318, "ᾲ": 319, "ᾳ": 320, "ᾴ": 321, "ᾶ": 322, "ᾷ": 323, "᾽": 324, "῀": 325, "ῂ": 326, "ῃ": 327, "ῄ": 328, "ῆ": 329, "ῇ": 330, "῍": 331, "῎": 332, "῏": 333, "ῑ": 334, "ῒ": 335, "ῖ": 336, "ῗ": 337, "῝": 338, "῞": 339, "ῠ": 340, "ῡ": 341, "ῢ": 342, "ῤ": 343, "ῥ": 344, "ῦ": 345, "ῧ": 346, "Ὺ": 347, "Ῥ": 348, "ῲ": 349, "ῳ": 350, "ῴ": 351, "ῶ": 352, "ῷ": 353, "῾": 354, "–": 355, "—": 356, "’": 357, "†": 358, "…": 359, "℧": 360, "∠": 361, "⏑": 362, "⏔": 363, "⟦": 364, "⟧": 365, "𐅵": 366, "𐅻": 367, "𝈅": 368, "𝈈": 369, "𝈉": 370, "𝈍": 371, "𝈓": 372, "𝈕": 373, "𝈱": 374, "𝈳": 375, "𝈶": 376, "𝈷": 377, "𝈸": 378, "𝈹": 379, "𝈾": 380}, "id2char": {"0": "", "1": "", "2": "", "3": " ", "4": "#", "5": "$", "6": "%", "7": "&", "8": "(", "9": ")", "10": "*", "11": ",", "12": "-", "13": ".", "14": "/", "15": "0", "16": "1", "17": "2", "18": "3", "19": "4", "20": "5", "21": "6", "22": "7", "23": "8", "24": "9", "25": ";", "26": "<", "27": "=", "28": ">", "29": "?", "30": "A", "31": "D", "32": "E", "33": "F", "34": "G", "35": "I", "36": "K", "37": "P", "38": "R", "39": "S", "40": "V", "41": "[", "42": "\\", "43": "]", "44": "_", "45": "`", "46": "c", "47": "e", "48": "f", "49": "g", "50": "i", "51": "n", "52": "o", "53": "s", "54": "t", "55": "v", "56": "x", "57": "{", "58": "}", "59": "~", "60": "·", "61": "í", "62": "ó", "63": "ʹ", "64": "ʼ", "65": "ʽ", "66": "́", "67": "̂", "68": "̅", "69": "̈", "70": "̊", "71": "̌", "72": "̓", "73": "̔", "74": "̣", "75": "̸", "76": "͂", "77": "ͅ", "78": "͜", "79": "Ͱ", "80": "ͱ", "81": "Ͳ", "82": "ͳ", "83": "͵", "84": "Ͷ", "85": "ͷ", "86": "΄", "87": "Ά", "88": "Έ", "89": "Ή", "90": "Ί", "91": "Ό", "92": "Ύ", "93": "Ώ", "94": "ΐ", "95": "Α", "96": "Β", "97": "Γ", "98": "Δ", "99": "Ε", "100": "Ζ", "101": "Η", "102": "Θ", "103": "Ι", "104": "Κ", "105": "Λ", "106": "Μ", "107": "Ν", "108": "Ξ", "109": "Ο", "110": "Π", "111": "Ρ", "112": "Σ", "113": "Τ", "114": "Υ", "115": "Φ", "116": "Χ", "117": "Ψ", "118": "Ω", "119": "Ϊ", "120": "ά", "121": "έ", "122": "ή", "123": "ί", "124": "ΰ", "125": "α", "126": "β", "127": "γ", "128": "δ", "129": "ε", "130": "ζ", "131": "η", "132": "θ", "133": "ι", "134": "κ", "135": "λ", "136": "μ", "137": "ν", "138": "ξ", "139": "ο", "140": "π", "141": "ρ", "142": "ς", "143": "σ", "144": "τ", "145": "υ", "146": "φ", "147": "χ", "148": "ψ", "149": "ω", "150": "ϊ", "151": "ϋ", "152": "ό", "153": "ύ", "154": "ώ", "155": "Ϗ", "156": "ϐ", "157": "ϑ", "158": "ϖ", "159": "ϗ", "160": "Ϙ", "161": "ϙ", "162": "Ϛ", "163": "ϛ", "164": "Ϝ", "165": "ϝ", "166": "Ϟ", "167": "ϟ", "168": "Ϡ", "169": "ϡ", "170": "ϰ", "171": "ϲ", "172": "Ϲ", "173": "Ϻ", "174": "ϻ", "175": "Ͻ", "176": "ἀ", "177": "ἁ", "178": "ἂ", "179": "ἃ", "180": "ἄ", "181": "ἅ", "182": "ἆ", "183": "ἇ", "184": "Ἀ", "185": "Ἁ", "186": "Ἂ", "187": "Ἃ", "188": "Ἄ", "189": "Ἅ", "190": "Ἆ", "191": "Ἇ", "192": "ἐ", "193": "ἑ", "194": "ἒ", "195": "ἓ", "196": "ἔ", "197": "ἕ", "198": "Ἐ", "199": "Ἑ", "200": "Ἒ", "201": "Ἓ", "202": "Ἔ", "203": "Ἕ", "204": "ἠ", "205": "ἡ", "206": "ἢ", "207": "ἣ", "208": "ἤ", "209": "ἥ", "210": "ἦ", "211": "ἧ", "212": "Ἠ", "213": "Ἡ", "214": "Ἢ", "215": "Ἣ", "216": "Ἤ", "217": "Ἥ", "218": "Ἦ", "219": "Ἧ", "220": "ἰ", "221": "ἱ", "222": "ἲ", "223": "ἳ", "224": "ἴ", "225": "ἵ", "226": "ἶ", "227": "ἷ", "228": "Ἰ", "229": "Ἱ", "230": "Ἲ", "231": "Ἳ", "232": "Ἴ", "233": "Ἵ", "234": "Ἶ", "235": "Ἷ", "236": "ὀ", "237": "ὁ", "238": "ὂ", "239": "ὃ", "240": "ὄ", "241": "ὅ", "242": "Ὀ", "243": "Ὁ", "244": "Ὃ", "245": "Ὄ", "246": "Ὅ", "247": "ὐ", "248": "ὑ", "249": "ὒ", "250": "ὓ", "251": "ὔ", "252": "ὕ", "253": "ὖ", "254": "ὗ", "255": "Ὑ", "256": "Ὓ", "257": "Ὕ", "258": "Ὗ", "259": "ὠ", "260": "ὡ", "261": "ὢ", "262": "ὣ", "263": "ὤ", "264": "ὥ", "265": "ὦ", "266": "ὧ", "267": "Ὠ", "268": "Ὡ", "269": "Ὢ", "270": "Ὣ", "271": "Ὤ", "272": "Ὥ", "273": "Ὦ", "274": "Ὧ", "275": "ὰ", "276": "ὲ", "277": "ὴ", "278": "ὶ", "279": "ὸ", "280": "ὺ", "281": "ὼ", "282": "ᾀ", "283": "ᾁ", "284": "ᾂ", "285": "ᾃ", "286": "ᾄ", "287": "ᾅ", "288": "ᾆ", "289": "ᾇ", "290": "ᾈ", "291": "ᾉ", "292": "ᾌ", "293": "ᾍ", "294": "ᾎ", "295": "ᾐ", "296": "ᾑ", "297": "ᾒ", "298": "ᾓ", "299": "ᾔ", "300": "ᾕ", "301": "ᾖ", "302": "ᾗ", "303": "ᾘ", "304": "ᾙ", "305": "ᾜ", "306": "ᾞ", "307": "ᾟ", "308": "ᾠ", "309": "ᾡ", "310": "ᾣ", "311": "ᾤ", "312": "ᾥ", "313": "ᾦ", "314": "ᾧ", "315": "ᾨ", "316": "ᾬ", "317": "ᾯ", "318": "ᾱ", "319": "ᾲ", "320": "ᾳ", "321": "ᾴ", "322": "ᾶ", "323": "ᾷ", "324": "᾽", "325": "῀", "326": "ῂ", "327": "ῃ", "328": "ῄ", "329": "ῆ", "330": "ῇ", "331": "῍", "332": "῎", "333": "῏", "334": "ῑ", "335": "ῒ", "336": "ῖ", "337": "ῗ", "338": "῝", "339": "῞", "340": "ῠ", "341": "ῡ", "342": "ῢ", "343": "ῤ", "344": "ῥ", "345": "ῦ", "346": "ῧ", "347": "Ὺ", "348": "Ῥ", "349": "ῲ", "350": "ῳ", "351": "ῴ", "352": "ῶ", "353": "ῷ", "354": "῾", "355": "–", "356": "—", "357": "’", "358": "†", "359": "…", "360": "℧", "361": "∠", "362": "⏑", "363": "⏔", "364": "⟦", "365": "⟧", "366": "𐅵", "367": "𐅻", "368": "𝈅", "369": "𝈈", "370": "𝈉", "371": "𝈍", "372": "𝈓", "373": "𝈕", "374": "𝈱", "375": "𝈳", "376": "𝈶", "377": "𝈷", "378": "𝈸", "379": "𝈹", "380": "𝈾"}}