{"char2id": {"<pad>": 0, "<bos>": 1, "<eos>": 2, " ": 3, "#": 4, "$": 5, "%": 6, "&": 7, ")": 8, "*": 9, "-": 10, ".": 11, "/": 12, "0": 13, "1": 14, "2": 15, "3": 16, "4": 17, "5": 18, "6": 19, "7": 20, "8": 21, "9": 22, ";": 23, "=": 24, "?": 25, "A": 26, "D": 27, "E": 28, "F": 29, "G": 30, "I": 31, "K": 32, "P": 33, "R": 34, "S": 35, "V": 36, "_": 37, "`": 38, "c": 39, "e": 40, "f": 41, "g": 42, "i": 43, "n": 44, "o": 45, "s": 46, "t": 47, "v": 48, "x": 49, "}": 50, "·": 51, "í": 52, "ó": 53, "ʹ": 54, "ʼ": 55, "ʽ": 56, "́": 57, "̂": 58, "̅": 59, "̈": 60, "̊": 61, "̌": 62, "̓": 63, "̔": 64, "̣": 65, "̸": 66, "͂": 67, "ͅ": 68, "͜": 69, "Ͱ": 70, "ͱ": 71, "Ͳ": 72, "ͳ": 73, "͵": 74, "Ͷ": 75, "ͷ": 76, "΄": 77, "Ά": 78, "Έ": 79, "Ή": 80, "Ί": 81, "Ό": 82, "Ύ": 83, "Ώ": 84, "ΐ": 85, "Α": 86, "Β": 87, "Γ": 88, "Δ": 89, "Ε": 90, "Ζ": 91, "Η": 92, "Θ": 93, "Ι": 94, "Κ": 95, "Λ": 96, "Μ": 97, "Ν": 98, "Ξ": 99, "Ο": 100, "Π": 101, "Ρ": 102, "Σ": 103, "Τ": 104, "Υ": 105, "Φ": 106, "Χ": 107, "Ψ": 108, "Ω": 109, "Ϊ": 110, "ά": 111, "έ": 112, "ή": 113, "ί": 114, "ΰ": 115, "α": 116, "β": 117, "γ": 118, "δ": 119, "ε": 120, "ζ": 121, "η": 122, "θ": 123, "ι": 124, "κ": 125, "λ": 126, "μ": 127, "ν": 128, "ξ": 129, "ο": 130, "π": 131, "ρ": 132, "ς": 133, "σ": 134, "τ": 135, "υ": 136, "φ": 137, "χ": 138, "ψ": 139, "ω": 140, "ϊ": 141, "ϋ": 142, "ό": 143, "ύ": 144, "ώ": 145, "Ϗ": 146, "ϐ": 147, "ϑ": 148, "ϖ": 149, "ϗ": 150, "Ϙ": 151, "ϙ": 152, "Ϛ": 153, "ϛ": 154, "Ϝ": 155, "ϝ": 156, "Ϟ": 157, "ϟ": 158, "Ϡ": 159, "ϡ": 160, "ϣ": 161, "ϫ": 162, "ϰ": 163, "ϲ": 164, "Ϲ": 165, "Ϻ": 166, "ϻ": 167, "Ͻ": 168, "ἀ": 169, "ἁ": 170, "ἂ": 171, "ἃ": 172, "ἄ": 173, "ἅ": 174, "ἆ": 175, "ἇ": 176, "Ἀ": 177, "Ἁ": 178, "Ἂ": 179, "Ἃ": 180, "Ἄ": 181, "Ἅ": 182, "Ἆ": 183, "Ἇ": 184, "ἐ": 185, "ἑ": 186, "ἒ": 187, "ἓ": 188, "ἔ": 189, "ἕ": 190, "Ἐ": 191, "Ἑ": 192, "Ἒ": 193, "Ἓ": 194, "Ἔ": 195, "Ἕ": 196, "ἠ": 197, "ἡ": 198, "ἢ": 199, "ἣ": 200, "ἤ": 201, "ἥ": 202, "ἦ": 203, "ἧ": 204, "Ἠ": 205, "Ἡ": 206, "Ἢ": 207, "Ἣ": 208, "Ἤ": 209, "Ἥ": 210, "Ἦ": 211, "Ἧ": 212, "ἰ": 213, "ἱ": 214, "ἲ": 215, "ἳ": 216, "ἴ": 217, "ἵ": 218, "ἶ": 219, "ἷ": 220, "Ἰ": 221, "Ἱ": 222, "Ἲ": 223, "Ἳ": 224, "Ἴ": 225, "Ἵ": 226, "Ἶ": 227, "Ἷ": 228, "ὀ": 229, "ὁ": 230, "ὂ": 231, "ὃ": 232, "ὄ": 233, "ὅ": 234, "Ὀ": 235, "Ὁ": 236, "Ὃ": 237, "Ὄ": 238, "Ὅ": 239, "ὐ": 240, "ὑ": 241, "ὒ": 242, "ὓ": 243, "ὔ": 244, "ὕ": 245, "ὖ": 246, "ὗ": 247, "Ὑ": 248, "Ὓ": 249, "Ὕ": 250, "Ὗ": 251, "ὠ": 252, "ὡ": 253, "ὢ": 254, "ὣ": 255, "ὤ": 256, "ὥ": 257, "ὦ": 258, "ὧ": 259, "Ὠ": 260, "Ὡ": 261, "Ὢ": 262, "Ὣ": 263, "Ὤ": 264, "Ὥ": 265, "Ὦ": 266, "Ὧ": 267, "ὰ": 268, "ὲ": 269, "ὴ": 270, "ὶ": 271, "ὸ": 272, "ὺ": 273, "ὼ": 274, "ᾀ": 275, "ᾁ": 276, "ᾂ": 277, "ᾃ": 278, "ᾄ": 279, "ᾅ": 280, "ᾆ": 281, "ᾇ": 282, "ᾈ": 283, "ᾉ": 284, "ᾌ": 285, "ᾍ": 286, "ᾎ": 287, "ᾐ": 288, "ᾑ": 289, "ᾒ": 290, "ᾓ": 291, "ᾔ": 292, "ᾕ": 293, "ᾖ": 294, "ᾗ": 295, "ᾘ": 296, "ᾙ": 297, "ᾜ": 298, "ᾞ": 299, "ᾟ": 300, "ᾠ": 301, "ᾡ": 302, "ᾣ": 303, "ᾤ": 304, "ᾥ": 305, "ᾦ": 306, "ᾧ": 307, "ᾨ": 308, "ᾬ": 309, "ᾯ": 310, "ᾱ": 311, "ᾲ": 312, "ᾳ": 313, "ᾴ": 314, "ᾶ": 315, "ᾷ": 316, "᾽": 317, "῀": 318, "ῂ": 319, "ῃ": 320, "ῄ": 321, "ῆ": 322, "ῇ": 323, "῍": 324, "῎": 325, "῏": 326, "ῑ": 327, "ῒ": 328, "ῖ": 329, "ῗ": 330, "῝": 331, "῞": 332, "ῠ": 333, "ῡ": 334, "ῢ": 335, "ῤ": 336, "ῥ": 337, "ῦ": 338, "ῧ": 339, "Ὺ": 340, "Ῥ": 341, "ῲ": 342, "ῳ": 343, "ῴ": 344, "ῶ": 345, "ῷ": 346, "῾": 347, "–": 348, "—": 349, "’": 350, "…": 351, "℧": 352, "∠": 353, "⏑": 354, "⏔": 355, "⟧": 356, "𐅵": 357, "𐅻": 358, "𝈅": 359, "𝈈": 360, "𝈉": 361, "𝈍": 362, "𝈓": 363, "𝈕": 364, "𝈱": 365, "𝈳": 366, "𝈶": 367, "𝈷": 368, "𝈸": 369, "𝈹": 370, "𝈾": 371}, "id2char": {"0": "", "1": "", "2": "", "3": " ", "4": "#", "5": "$", "6": "%", "7": "&", "8": ")", "9": "*", "10": "-", "11": ".", "12": "/", "13": "0", "14": "1", "15": "2", "16": "3", "17": "4", "18": "5", "19": "6", "20": "7", "21": "8", "22": "9", "23": ";", "24": "=", "25": "?", "26": "A", "27": "D", "28": "E", "29": "F", "30": "G", "31": "I", "32": "K", "33": "P", "34": "R", "35": "S", "36": "V", "37": "_", "38": "`", "39": "c", "40": "e", "41": "f", "42": "g", "43": "i", "44": "n", "45": "o", "46": "s", "47": "t", "48": "v", "49": "x", "50": "}", "51": "·", "52": "í", "53": "ó", "54": "ʹ", "55": "ʼ", "56": "ʽ", "57": "́", "58": "̂", "59": "̅", "60": "̈", "61": "̊", "62": "̌", "63": "̓", "64": "̔", "65": "̣", "66": "̸", "67": "͂", "68": "ͅ", "69": "͜", "70": "Ͱ", "71": "ͱ", "72": "Ͳ", "73": "ͳ", "74": "͵", "75": "Ͷ", "76": "ͷ", "77": "΄", "78": "Ά", "79": "Έ", "80": "Ή", "81": "Ί", "82": "Ό", "83": "Ύ", "84": "Ώ", "85": "ΐ", "86": "Α", "87": "Β", "88": "Γ", "89": "Δ", "90": "Ε", "91": "Ζ", "92": "Η", "93": "Θ", "94": "Ι", "95": "Κ", "96": "Λ", "97": "Μ", "98": "Ν", "99": "Ξ", "100": "Ο", "101": "Π", "102": "Ρ", "103": "Σ", "104": "Τ", "105": "Υ", "106": "Φ", "107": "Χ", "108": "Ψ", "109": "Ω", "110": "Ϊ", "111": "ά", "112": "έ", "113": "ή", "114": "ί", "115": "ΰ", "116": "α", "117": "β", "118": "γ", "119": "δ", "120": "ε", "121": "ζ", "122": "η", "123": "θ", "124": "ι", "125": "κ", "126": "λ", "127": "μ", "128": "ν", "129": "ξ", "130": "ο", "131": "π", "132": "ρ", "133": "ς", "134": "σ", "135": "τ", "136": "υ", "137": "φ", "138": "χ", "139": "ψ", "140": "ω", "141": "ϊ", "142": "ϋ", "143": "ό", "144": "ύ", "145": "ώ", "146": "Ϗ", "147": "ϐ", "148": "ϑ", "149": "ϖ", "150": "ϗ", "151": "Ϙ", "152": "ϙ", "153": "Ϛ", "154": "ϛ", "155": "Ϝ", "156": "ϝ", "157": "Ϟ", "158": "ϟ", "159": "Ϡ", "160": "ϡ", "161": "ϣ", "162": "ϫ", "163": "ϰ", "164": "ϲ", "165": "Ϲ", "166": "Ϻ", "167": "ϻ", "168": "Ͻ", "169": "ἀ", "170": "ἁ", "171": "ἂ", "172": "ἃ", "173": "ἄ", "174": "ἅ", "175": "ἆ", "176": "ἇ", "177": "Ἀ", "178": "Ἁ", "179": "Ἂ", "180": "Ἃ", "181": "Ἄ", "182": "Ἅ", "183": "Ἆ", "184": "Ἇ", "185": "ἐ", "186": "ἑ", "187": "ἒ", "188": "ἓ", "189": "ἔ", "190": "ἕ", "191": "Ἐ", "192": "Ἑ", "193": "Ἒ", "194": "Ἓ", "195": "Ἔ", "196": "Ἕ", "197": "ἠ", "198": "ἡ", "199": "ἢ", "200": "ἣ", "201": "ἤ", "202": "ἥ", "203": "ἦ", "204": "ἧ", "205": "Ἠ", "206": "Ἡ", "207": "Ἢ", "208": "Ἣ", "209": "Ἤ", "210": "Ἥ", "211": "Ἦ", "212": "Ἧ", "213": "ἰ", "214": "ἱ", "215": "ἲ", "216": "ἳ", "217": "ἴ", "218": "ἵ", "219": "ἶ", "220": "ἷ", "221": "Ἰ", "222": "Ἱ", "223": "Ἲ", "224": "Ἳ", "225": "Ἴ", "226": "Ἵ", "227": "Ἶ", "228": "Ἷ", "229": "ὀ", "230": "ὁ", "231": "ὂ", "232": "ὃ", "233": "ὄ", "234": "ὅ", "235": "Ὀ", "236": "Ὁ", "237": "Ὃ", "238": "Ὄ", "239": "Ὅ", "240": "ὐ", "241": "ὑ", "242": "ὒ", "243": "ὓ", "244": "ὔ", "245": "ὕ", "246": "ὖ", "247": "ὗ", "248": "Ὑ", "249": "Ὓ", "250": "Ὕ", "251": "Ὗ", "252": "ὠ", "253": "ὡ", "254": "ὢ", "255": "ὣ", "256": "ὤ", "257": "ὥ", "258": "ὦ", "259": "ὧ", "260": "Ὠ", "261": "Ὡ", "262": "Ὢ", "263": "Ὣ", "264": "Ὤ", "265": "Ὥ", "266": "Ὦ", "267": "Ὧ", "268": "ὰ", "269": "ὲ", "270": "ὴ", "271": "ὶ", "272": "ὸ", "273": "ὺ", "274": "ὼ", "275": "ᾀ", "276": "ᾁ", "277": "ᾂ", "278": "ᾃ", "279": "ᾄ", "280": "ᾅ", "281": "ᾆ", "282": "ᾇ", "283": "ᾈ", "284": "ᾉ", "285": "ᾌ", "286": "ᾍ", "287": "ᾎ", "288": "ᾐ", "289": "ᾑ", "290": "ᾒ", "291": "ᾓ", "292": "ᾔ", "293": "ᾕ", "294": "ᾖ", "295": "ᾗ", "296": "ᾘ", "297": "ᾙ", "298": "ᾜ", "299": "ᾞ", "300": "ᾟ", "301": "ᾠ", "302": "ᾡ", "303": "ᾣ", "304": "ᾤ", "305": "ᾥ", "306": "ᾦ", "307": "ᾧ", "308": "ᾨ", "309": "ᾬ", "310": "ᾯ", "311": "ᾱ", "312": "ᾲ", "313": "ᾳ", "314": "ᾴ", "315": "ᾶ", "316": "ᾷ", "317": "᾽", "318": "῀", "319": "ῂ", "320": "ῃ", "321": "ῄ", "322": "ῆ", "323": "ῇ", "324": "῍", "325": "῎", "326": "῏", "327": "ῑ", "328": "ῒ", "329": "ῖ", "330": "ῗ", "331": "῝", "332": "῞", "333": "ῠ", "334": "ῡ", "335": "ῢ", "336": "ῤ", "337": "ῥ", "338": "ῦ", "339": "ῧ", "340": "Ὺ", "341": "Ῥ", "342": "ῲ", "343": "ῳ", "344": "ῴ", "345": "ῶ", "346": "ῷ", "347": "῾", "348": "–", "349": "—", "350": "’", "351": "…", "352": "℧", "353": "∠", "354": "⏑", "355": "⏔", "356": "⟧", "357": "𐅵", "358": "𐅻", "359": "𝈅", "360": "𝈈", "361": "𝈉", "362": "𝈍", "363": "𝈓", "364": "𝈕", "365": "𝈱", "366": "𝈳", "367": "𝈶", "368": "𝈷", "369": "𝈸", "370": "𝈹", "371": "𝈾"}}