{"char2id": {"<pad>": 0, "<bos>": 1, "<eos>": 2, "́": 3, "̂": 4, "̊": 5, "̌": 6, "̓": 7, "̔": 8, "̣": 9, "͂": 10, "͜": 11, "Ͱ": 12, "ͱ": 13, "Ͳ": 14, "ͳ": 15, "͵": 16, "Ͷ": 17, "ͷ": 18, "΄": 19, "Ά": 20, "Έ": 21, "Ή": 22, "Ί": 23, "Ό": 24, "Ύ": 25, "Ώ": 26, "ΐ": 27, "Α": 28, "Β": 29, "Γ": 30, "Δ": 31, "Ε": 32, "Ζ": 33, "Η": 34, "Θ": 35, "Ι": 36, "Κ": 37, "Λ": 38, "Μ": 39, "Ν": 40, "Ξ": 41, "Ο": 42, "Π": 43, "Ρ": 44, "Σ": 45, "Τ": 46, "Υ": 47, "Φ": 48, "Χ": 49, "Ψ": 50, "Ω": 51, "Ϊ": 52, "ά": 53, "έ": 54, "ή": 55, "ί": 56, "ΰ": 57, "α": 58, "β": 59, "γ": 60, "δ": 61, "ε": 62, "ζ": 63, "η": 64, "θ": 65, "ι": 66, "κ": 67, "λ": 68, "μ": 69, "ν": 70, "ξ": 71, "ο": 72, "π": 73, "ρ": 74, "ς": 75, "σ": 76, "τ": 77, "υ": 78, "φ": 79, "χ": 80, "ψ": 81, "ω": 82, "ϊ": 83, "ϋ": 84, "ό": 85, "ύ": 86, "ώ": 87, "Ϗ": 88, "ϐ": 89, "ϑ": 90, "ϖ": 91, "ϗ": 92, "Ϙ": 93, "ϙ": 94, "Ϛ": 95, "ϛ": 96, "Ϝ": 97, "ϝ": 98, "Ϟ": 99, "ϟ": 100, "Ϡ": 101, "ϡ": 102, "ϣ": 103, "ϫ": 104, "ϰ": 105, "ϲ": 106, "Ϲ": 107, "Ϻ": 108, "ϻ": 109, "ἀ": 110, "ἁ": 111, "ἄ": 112, "ἅ": 113, "ἆ": 114, "ἇ": 115, "Ἀ": 116, "Ἁ": 117, "Ἄ": 118, "Ἅ": 119, "Ἆ": 120, "Ἇ": 121, "ἐ": 122, "ἑ": 123, "ἔ": 124, "ἕ": 125, "Ἐ": 126, "Ἑ": 127, "Ἒ": 128, "Ἓ": 129, "Ἔ": 130, "Ἕ": 131, "ἠ": 132, "ἡ": 133, "ἤ": 134, "ἥ": 135, "ἦ": 136, "ἧ": 137, "Ἠ": 138, "Ἡ": 139, "Ἢ": 140, "Ἤ": 141, "Ἥ": 142, "Ἦ": 143, "Ἧ": 144, "ἰ": 145, "ἱ": 146, "ἴ": 147, "ἵ": 148, "ἶ": 149, "ἷ": 150, "Ἰ": 151, "Ἱ": 152, "Ἳ": 153, "Ἴ": 154, "Ἵ": 155, "Ἶ": 156, "Ἷ": 157, "ὀ": 158, "ὁ": 159, "ὄ": 160, "ὅ": 161, "Ὀ": 162, "Ὁ": 163, "Ὄ": 164, "Ὅ": 165, "ὐ": 166, "ὑ": 167, "ὔ": 168, "ὕ": 169, "ὖ": 170, "ὗ": 171, "Ὑ": 172, "Ὕ": 173, "ὠ": 174, "ὡ": 175, "ὤ": 176, "ὥ": 177, "ὦ": 178, "ὧ": 179, "Ὠ": 180, "Ὡ": 181, "Ὤ": 182, "Ὥ": 183, "Ὦ": 184, "Ὧ": 185, "ὰ": 186, "ὲ": 187, "ὴ": 188, "ὶ": 189, "ὸ": 190, "ὺ": 191, "ὼ": 192, "ᾀ": 193, "ᾁ": 194, "ᾄ": 195, "ᾅ": 196, "ᾆ": 197, "ᾈ": 198, "ᾍ": 199, "ᾐ": 200, "ᾑ": 201, "ᾔ": 202, "ᾕ": 203, "ᾖ": 204, "ᾗ": 205, "ᾠ": 206, "ᾤ": 207, "ᾦ": 208, "ᾧ": 209, "ᾨ": 210, "ᾳ": 211, "ᾴ": 212, "ᾶ": 213, "ᾷ": 214, "᾽": 215, "ῃ": 216, "ῄ": 217, "ῆ": 218, "ῇ": 219, "ῒ": 220, "ῖ": 221, "ῗ": 222, "ῤ": 223, "ῥ": 224, "ῦ": 225, "ῧ": 226, "Ὺ": 227, "Ῥ": 228, "ῳ": 229, "ῴ": 230, "ῶ": 231, "ῷ": 232, "῾": 233}, "id2char": {"0": "", "1": "", "2": "", "3": "́", "4": "̂", "5": "̊", "6": "̌", "7": "̓", "8": "̔", "9": "̣", "10": "͂", "11": "͜", "12": "Ͱ", "13": "ͱ", "14": "Ͳ", "15": "ͳ", "16": "͵", "17": "Ͷ", "18": "ͷ", "19": "΄", "20": "Ά", "21": "Έ", "22": "Ή", "23": "Ί", "24": "Ό", "25": "Ύ", "26": "Ώ", "27": "ΐ", "28": "Α", "29": "Β", "30": "Γ", "31": "Δ", "32": "Ε", "33": "Ζ", "34": "Η", "35": "Θ", "36": "Ι", "37": "Κ", "38": "Λ", "39": "Μ", "40": "Ν", "41": "Ξ", "42": "Ο", "43": "Π", "44": "Ρ", "45": "Σ", "46": "Τ", "47": "Υ", "48": "Φ", "49": "Χ", "50": "Ψ", "51": "Ω", "52": "Ϊ", "53": "ά", "54": "έ", "55": "ή", "56": "ί", "57": "ΰ", "58": "α", "59": "β", "60": "γ", "61": "δ", "62": "ε", "63": "ζ", "64": "η", "65": "θ", "66": "ι", "67": "κ", "68": "λ", "69": "μ", "70": "ν", "71": "ξ", "72": "ο", "73": "π", "74": "ρ", "75": "ς", "76": "σ", "77": "τ", "78": "υ", "79": "φ", "80": "χ", "81": "ψ", "82": "ω", "83": "ϊ", "84": "ϋ", "85": "ό", "86": "ύ", "87": "ώ", "88": "Ϗ", "89": "ϐ", "90": "ϑ", "91": "ϖ", "92": "ϗ", "93": "Ϙ", "94": "ϙ", "95": "Ϛ", "96": "ϛ", "97": "Ϝ", "98": "ϝ", "99": "Ϟ", "100": "ϟ", "101": "Ϡ", "102": "ϡ", "103": "ϣ", "104": "ϫ", "105": "ϰ", "106": "ϲ", "107": "Ϲ", "108": "Ϻ", "109": "ϻ", "110": "ἀ", "111": "ἁ", "112": "ἄ", "113": "ἅ", "114": "ἆ", "115": "ἇ", "116": "Ἀ", "117": "Ἁ", "118": "Ἄ", "119": "Ἅ", "120": "Ἆ", "121": "Ἇ", "122": "ἐ", "123": "ἑ", "124": "ἔ", "125": "ἕ", "126": "Ἐ", "127": "Ἑ", "128": "Ἒ", "129": "Ἓ", "130": "Ἔ", "131": "Ἕ", "132": "ἠ", "133": "ἡ", "134": "ἤ", "135": "ἥ", "136": "ἦ", "137": "ἧ", "138": "Ἠ", "139": "Ἡ", "140": "Ἢ", "141": "Ἤ", "142": "Ἥ", "143": "Ἦ", "144": "Ἧ", "145": "ἰ", "146": "ἱ", "147": "ἴ", "148": "ἵ", "149": "ἶ", "150": "ἷ", "151": "Ἰ", "152": "Ἱ", "153": "Ἳ", "154": "Ἴ", "155": "Ἵ", "156": "Ἶ", "157": "Ἷ", "158": "ὀ", "159": "ὁ", "160": "ὄ", "161": "ὅ", "162": "Ὀ", "163": "Ὁ", "164": "Ὄ", "165": "Ὅ", "166": "ὐ", "167": "ὑ", "168": "ὔ", "169": "ὕ", "170": "ὖ", "171": "ὗ", "172": "Ὑ", "173": "Ὕ", "174": "ὠ", "175": "ὡ", "176": "ὤ", "177": "ὥ", "178": "ὦ", "179": "ὧ", "180": "Ὠ", "181": "Ὡ", "182": "Ὤ", "183": "Ὥ", "184": "Ὦ", "185": "Ὧ", "186": "ὰ", "187": "ὲ", "188": "ὴ", "189": "ὶ", "190": "ὸ", "191": "ὺ", "192": "ὼ", "193": "ᾀ", "194": "ᾁ", "195": "ᾄ", "196": "ᾅ", "197": "ᾆ", "198": "ᾈ", "199": "ᾍ", "200": "ᾐ", "201": "ᾑ", "202": "ᾔ", "203": "ᾕ", "204": "ᾖ", "205": "ᾗ", "206": "ᾠ", "207": "ᾤ", "208": "ᾦ", "209": "ᾧ", "210": "ᾨ", "211": "ᾳ", "212": "ᾴ", "213": "ᾶ", "214": "ᾷ", "215": "᾽", "216": "ῃ", "217": "ῄ", "218": "ῆ", "219": "ῇ", "220": "ῒ", "221": "ῖ", "222": "ῗ", "223": "ῤ", "224": "ῥ", "225": "ῦ", "226": "ῧ", "227": "Ὺ", "228": "Ῥ", "229": "ῳ", "230": "ῴ", "231": "ῶ", "232": "ῷ", "233": "῾"}}