{"char2id": {"<pad>": 0, "<bos>": 1, "<eos>": 2, " ": 3, "%": 4, "(": 5, ")": 6, ",": 7, "-": 8, ".": 9, "/": 10, ";": 11, "<": 12, ">": 13, "?": 14, "E": 15, "K": 16, "L": 17, "N": 18, "[": 19, "\\": 20, "]": 21, "a": 22, "i": 23, "j": 24, "m": 25, "o": 26, "r": 27, "s": 28, "u": 29, "v": 30, "{": 31, "~": 32, "·": 33, "ʹ": 34, "ʼ": 35, "ʽ": 36, "́": 37, "̂": 38, "̈": 39, "̊": 40, "̌": 41, "̓": 42, "̔": 43, "̣": 44, "͂": 45, "͜": 46, "Ͱ": 47, "ͱ": 48, "Ͳ": 49, "ͳ": 50, "͵": 51, "Ͷ": 52, "ͷ": 53, "΄": 54, "Ά": 55, "Έ": 56, "Ή": 57, "Ί": 58, "Ό": 59, "Ύ": 60, "Ώ": 61, "ΐ": 62, "Α": 63, "Β": 64, "Γ": 65, "Δ": 66, "Ε": 67, "Ζ": 68, "Η": 69, "Θ": 70, "Ι": 71, "Κ": 72, "Λ": 73, "Μ": 74, "Ν": 75, "Ξ": 76, "Ο": 77, "Π": 78, "Ρ": 79, "Σ": 80, "Τ": 81, "Υ": 82, "Φ": 83, "Χ": 84, "Ψ": 85, "Ω": 86, "Ϊ": 87, "ά": 88, "έ": 89, "ή": 90, "ί": 91, "ΰ": 92, "α": 93, "β": 94, "γ": 95, "δ": 96, "ε": 97, "ζ": 98, "η": 99, "θ": 100, "ι": 101, "κ": 102, "λ": 103, "μ": 104, "ν": 105, "ξ": 106, "ο": 107, "π": 108, "ρ": 109, "ς": 110, "σ": 111, "τ": 112, "υ": 113, "φ": 114, "χ": 115, "ψ": 116, "ω": 117, "ϊ": 118, "ϋ": 119, "ό": 120, "ύ": 121, "ώ": 122, "Ϗ": 123, "ϐ": 124, "ϑ": 125, "ϖ": 126, "ϗ": 127, "Ϙ": 128, "ϙ": 129, "Ϛ": 130, "ϛ": 131, "Ϝ": 132, "ϝ": 133, "Ϟ": 134, "ϟ": 135, "Ϡ": 136, "ϡ": 137, "ϣ": 138, "ϫ": 139, "ϰ": 140, "ϲ": 141, "Ϲ": 142, "Ϻ": 143, "ϻ": 144, "ἀ": 145, "ἁ": 146, "ἂ": 147, "ἃ": 148, "ἄ": 149, "ἅ": 150, "ἆ": 151, "ἇ": 152, "Ἀ": 153, "Ἁ": 154, "Ἄ": 155, "Ἅ": 156, "Ἆ": 157, "Ἇ": 158, "ἐ": 159, "ἑ": 160, "ἒ": 161, "ἓ": 162, "ἔ": 163, "ἕ": 164, "Ἐ": 165, "Ἑ": 166, "Ἒ": 167, "Ἓ": 168, "Ἔ": 169, "Ἕ": 170, "ἠ": 171, "ἡ": 172, "ἢ": 173, "ἤ": 174, "ἥ": 175, "ἦ": 176, "ἧ": 177, "Ἠ": 178, "Ἡ": 179, "Ἢ": 180, "Ἤ": 181, "Ἥ": 182, "Ἦ": 183, "Ἧ": 184, "ἰ": 185, "ἱ": 186, "ἲ": 187, "ἴ": 188, "ἵ": 189, "ἶ": 190, "ἷ": 191, "Ἰ": 192, "Ἱ": 193, "Ἲ": 194, "Ἳ": 195, "Ἴ": 196, "Ἵ": 197, "Ἶ": 198, "Ἷ": 199, "ὀ": 200, "ὁ": 201, "ὂ": 202, "ὃ": 203, "ὄ": 204, "ὅ": 205, "Ὀ": 206, "Ὁ": 207, "Ὃ": 208, "Ὄ": 209, "Ὅ": 210, "ὐ": 211, "ὑ": 212, "ὒ": 213, "ὓ": 214, "ὔ": 215, "ὕ": 216, "ὖ": 217, "ὗ": 218, "Ὑ": 219, "Ὕ": 220, "ὠ": 221, "ὡ": 222, "ὢ": 223, "ὣ": 224, "ὤ": 225, "ὥ": 226, "ὦ": 227, "ὧ": 228, "Ὠ": 229, "Ὡ": 230, "Ὣ": 231, "Ὤ": 232, "Ὥ": 233, "Ὦ": 234, "Ὧ": 235, "ὰ": 236, "ὲ": 237, "ὴ": 238, "ὶ": 239, "ὸ": 240, "ὺ": 241, "ὼ": 242, "ᾀ": 243, "ᾁ": 244, "ᾄ": 245, "ᾅ": 246, "ᾆ": 247, "ᾇ": 248, "ᾈ": 249, "ᾍ": 250, "ᾐ": 251, "ᾑ": 252, "ᾔ": 253, "ᾕ": 254, "ᾖ": 255, "ᾗ": 256, "ᾠ": 257, "ᾤ": 258, "ᾦ": 259, "ᾧ": 260, "ᾨ": 261, "ᾳ": 262, "ᾴ": 263, "ᾶ": 264, "ᾷ": 265, "᾽": 266, "ῂ": 267, "ῃ": 268, "ῄ": 269, "ῆ": 270, "ῇ": 271, "῎": 272, "ῒ": 273, "ῖ": 274, "ῗ": 275, "ῢ": 276, "ῤ": 277, "ῥ": 278, "ῦ": 279, "ῧ": 280, "Ὺ": 281, "Ῥ": 282, "ῲ": 283, "ῳ": 284, "ῴ": 285, "ῶ": 286, "ῷ": 287, "῾": 288, "’": 289, "†": 290, "⟦": 291, "⟧": 292}, "id2char": {"0": "", "1": "", "2": "", "3": " ", "4": "%", "5": "(", "6": ")", "7": ",", "8": "-", "9": ".", "10": "/", "11": ";", "12": "<", "13": ">", "14": "?", "15": "E", "16": "K", "17": "L", "18": "N", "19": "[", "20": "\\", "21": "]", "22": "a", "23": "i", "24": "j", "25": "m", "26": "o", "27": "r", "28": "s", "29": "u", "30": "v", "31": "{", "32": "~", "33": "·", "34": "ʹ", "35": "ʼ", "36": "ʽ", "37": "́", "38": "̂", "39": "̈", "40": "̊", "41": "̌", "42": "̓", "43": "̔", "44": "̣", "45": "͂", "46": "͜", "47": "Ͱ", "48": "ͱ", "49": "Ͳ", "50": "ͳ", "51": "͵", "52": "Ͷ", "53": "ͷ", "54": "΄", "55": "Ά", "56": "Έ", "57": "Ή", "58": "Ί", "59": "Ό", "60": "Ύ", "61": "Ώ", "62": "ΐ", "63": "Α", "64": "Β", "65": "Γ", "66": "Δ", "67": "Ε", "68": "Ζ", "69": "Η", "70": "Θ", "71": "Ι", "72": "Κ", "73": "Λ", "74": "Μ", "75": "Ν", "76": "Ξ", "77": "Ο", "78": "Π", "79": "Ρ", "80": "Σ", "81": "Τ", "82": "Υ", "83": "Φ", "84": "Χ", "85": "Ψ", "86": "Ω", "87": "Ϊ", "88": "ά", "89": "έ", "90": "ή", "91": "ί", "92": "ΰ", "93": "α", "94": "β", "95": "γ", "96": "δ", "97": "ε", "98": "ζ", "99": "η", "100": "θ", "101": "ι", "102": "κ", "103": "λ", "104": "μ", "105": "ν", "106": "ξ", "107": "ο", "108": "π", "109": "ρ", "110": "ς", "111": "σ", "112": "τ", "113": "υ", "114": "φ", "115": "χ", "116": "ψ", "117": "ω", "118": "ϊ", "119": "ϋ", "120": "ό", "121": "ύ", "122": "ώ", "123": "Ϗ", "124": "ϐ", "125": "ϑ", "126": "ϖ", "127": "ϗ", "128": "Ϙ", "129": "ϙ", "130": "Ϛ", "131": "ϛ", "132": "Ϝ", "133": "ϝ", "134": "Ϟ", "135": "ϟ", "136": "Ϡ", "137": "ϡ", "138": "ϣ", "139": "ϫ", "140": "ϰ", "141": "ϲ", "142": "Ϲ", "143": "Ϻ", "144": "ϻ", "145": "ἀ", "146": "ἁ", "147": "ἂ", "148": "ἃ", "149": "ἄ", "150": "ἅ", "151": "ἆ", "152": "ἇ", "153": "Ἀ", "154": "Ἁ", "155": "Ἄ", "156": "Ἅ", "157": "Ἆ", "158": "Ἇ", "159": "ἐ", "160": "ἑ", "161": "ἒ", "162": "ἓ", "163": "ἔ", "164": "ἕ", "165": "Ἐ", "166": "Ἑ", "167": "Ἒ", "168": "Ἓ", "169": "Ἔ", "170": "Ἕ", "171": "ἠ", "172": "ἡ", "173": "ἢ", "174": "ἤ", "175": "ἥ", "176": "ἦ", "177": "ἧ", "178": "Ἠ", "179": "Ἡ", "180": "Ἢ", "181": "Ἤ", "182": "Ἥ", "183": "Ἦ", "184": "Ἧ", "185": "ἰ", "186": "ἱ", "187": "ἲ", "188": "ἴ", "189": "ἵ", "190": "ἶ", "191": "ἷ", "192": "Ἰ", "193": "Ἱ", "194": "Ἲ", "195": "Ἳ", "196": "Ἴ", "197": "Ἵ", "198": "Ἶ", "199": "Ἷ", "200": "ὀ", "201": "ὁ", "202": "ὂ", "203": "ὃ", "204": "ὄ", "205": "ὅ", "206": "Ὀ", "207": "Ὁ", "208": "Ὃ", "209": "Ὄ", "210": "Ὅ", "211": "ὐ", "212": "ὑ", "213": "ὒ", "214": "ὓ", "215": "ὔ", "216": "ὕ", "217": "ὖ", "218": "ὗ", "219": "Ὑ", "220": "Ὕ", "221": "ὠ", "222": "ὡ", "223": "ὢ", "224": "ὣ", "225": "ὤ", "226": "ὥ", "227": "ὦ", "228": "ὧ", "229": "Ὠ", "230": "Ὡ", "231": "Ὣ", "232": "Ὤ", "233": "Ὥ", "234": "Ὦ", "235": "Ὧ", "236": "ὰ", "237": "ὲ", "238": "ὴ", "239": "ὶ", "240": "ὸ", "241": "ὺ", "242": "ὼ", "243": "ᾀ", "244": "ᾁ", "245": "ᾄ", "246": "ᾅ", "247": "ᾆ", "248": "ᾇ", "249": "ᾈ", "250": "ᾍ", "251": "ᾐ", "252": "ᾑ", "253": "ᾔ", "254": "ᾕ", "255": "ᾖ", "256": "ᾗ", "257": "ᾠ", "258": "ᾤ", "259": "ᾦ", "260": "ᾧ", "261": "ᾨ", "262": "ᾳ", "263": "ᾴ", "264": "ᾶ", "265": "ᾷ", "266": "᾽", "267": "ῂ", "268": "ῃ", "269": "ῄ", "270": "ῆ", "271": "ῇ", "272": "῎", "273": "ῒ", "274": "ῖ", "275": "ῗ", "276": "ῢ", "277": "ῤ", "278": "ῥ", "279": "ῦ", "280": "ῧ", "281": "Ὺ", "282": "Ῥ", "283": "ῲ", "284": "ῳ", "285": "ῴ", "286": "ῶ", "287": "ῷ", "288": "῾", "289": "’", "290": "†", "291": "⟦", "292": "⟧"}}