{"char2id": {"<pad>": 0, "<bos>": 1, "<eos>": 2, " ": 3, "%": 4, "(": 5, ")": 6, ",": 7, "-": 8, ".": 9, "/": 10, ";": 11, "<": 12, ">": 13, "?": 14, "[": 15, "\\": 16, "]": 17, "{": 18, "~": 19, "·": 20, "́": 21, "̂": 22, "̈": 23, "̊": 24, "̌": 25, "̓": 26, "̔": 27, "̣": 28, "͂": 29, "͜": 30, "Ͱ": 31, "ͱ": 32, "Ͳ": 33, "ͳ": 34, "͵": 35, "Ͷ": 36, "ͷ": 37, "΄": 38, "Ά": 39, "Έ": 40, "Ή": 41, "Ί": 42, "Ό": 43, "Ύ": 44, "Ώ": 45, "ΐ": 46, "Α": 47, "Β": 48, "Γ": 49, "Δ": 50, "Ε": 51, "Ζ": 52, "Η": 53, "Θ": 54, "Ι": 55, "Κ": 56, "Λ": 57, "Μ": 58, "Ν": 59, "Ξ": 60, "Ο": 61, "Π": 62, "Ρ": 63, "Σ": 64, "Τ": 65, "Υ": 66, "Φ": 67, "Χ": 68, "Ψ": 69, "Ω": 70, "Ϊ": 71, "ά": 72, "έ": 73, "ή": 74, "ί": 75, "ΰ": 76, "α": 77, "β": 78, "γ": 79, "δ": 80, "ε": 81, "ζ": 82, "η": 83, "θ": 84, "ι": 85, "κ": 86, "λ": 87, "μ": 88, "ν": 89, "ξ": 90, "ο": 91, "π": 92, "ρ": 93, "ς": 94, "σ": 95, "τ": 96, "υ": 97, "φ": 98, "χ": 99, "ψ": 100, "ω": 101, "ϊ": 102, "ϋ": 103, "ό": 104, "ύ": 105, "ώ": 106, "Ϗ": 107, "ϐ": 108, "ϑ": 109, "ϖ": 110, "ϗ": 111, "Ϙ": 112, "ϙ": 113, "Ϛ": 114, "ϛ": 115, "Ϝ": 116, "ϝ": 117, "Ϟ": 118, "ϟ": 119, "Ϡ": 120, "ϡ": 121, "ϰ": 122, "ϲ": 123, "Ϲ": 124, "Ϻ": 125, "ϻ": 126, "ἀ": 127, "ἁ": 128, "ἂ": 129, "ἃ": 130, "ἄ": 131, "ἅ": 132, "ἆ": 133, "ἇ": 134, "Ἀ": 135, "Ἁ": 136, "Ἄ": 137, "Ἅ": 138, "Ἆ": 139, "Ἇ": 140, "ἐ": 141, "ἑ": 142, "ἒ": 143, "ἓ": 144, "ἔ": 145, "ἕ": 146, "Ἐ": 147, "Ἑ": 148, "Ἒ": 149, "Ἓ": 150, "Ἔ": 151, "Ἕ": 152, "ἠ": 153, "ἡ": 154, "ἢ": 155, "ἤ": 156, "ἥ": 157, "ἦ": 158, "ἧ": 159, "Ἠ": 160, "Ἡ": 161, "Ἢ": 162, "Ἤ": 163, "Ἥ": 164, "Ἦ": 165, "Ἧ": 166, "ἰ": 167, "ἱ": 168, "ἲ": 169, "ἴ": 170, "ἵ": 171, "ἶ": 172, "ἷ": 173, "Ἰ": 174, "Ἱ": 175, "Ἲ": 176, "Ἳ": 177, "Ἴ": 178, "Ἵ": 179, "Ἶ": 180, "Ἷ": 181, "ὀ": 182, "ὁ": 183, "ὂ": 184, "ὃ": 185, "ὄ": 186, "ὅ": 187, "Ὀ": 188, "Ὁ": 189, "Ὃ": 190, "Ὄ": 191, "Ὅ": 192, "ὐ": 193, "ὑ": 194, "ὒ": 195, "ὓ": 196, "ὔ": 197, "ὕ": 198, "ὖ": 199, "ὗ": 200, "Ὑ": 201, "Ὕ": 202, "ὠ": 203, "ὡ": 204, "ὢ": 205, "ὣ": 206, "ὤ": 207, "ὥ": 208, "ὦ": 209, "ὧ": 210, "Ὠ": 211, "Ὡ": 212, "Ὣ": 213, "Ὤ": 214, "Ὥ": 215, "Ὦ": 216, "Ὧ": 217, "ὰ": 218, "ὲ": 219, "ὴ": 220, "ὶ": 221, "ὸ": 222, "ὺ": 223, "ὼ": 224, "ᾀ": 225, "ᾁ": 226, "ᾄ": 227, "ᾅ": 228, "ᾆ": 229, "ᾇ": 230, "ᾈ": 231, "ᾍ": 232, "ᾐ": 233, "ᾑ": 234, "ᾔ": 235, "ᾕ": 236, "ᾖ": 237, "ᾗ": 238, "ᾠ": 239, "ᾤ": 240, "ᾦ": 241, "ᾧ": 242, "ᾨ": 243, "ᾳ": 244, "ᾴ": 245, "ᾶ": 246, "ᾷ": 247, "᾽": 248, "ῂ": 249, "ῃ": 250, "ῄ": 251, "ῆ": 252, "ῇ": 253, "῎": 254, "ῒ": 255, "ῖ": 256, "ῗ": 257, "ῢ": 258, "ῤ": 259, "ῥ": 260, "ῦ": 261, "ῧ": 262, "Ὺ": 263, "Ῥ": 264, "ῲ": 265, "ῳ": 266, "ῴ": 267, "ῶ": 268, "ῷ": 269, "῾": 270, "’": 271, "†": 272, "⟦": 273, "⟧": 274}, "id2char": {"0": "", "1": "", "2": "", "3": " ", "4": "%", "5": "(", "6": ")", "7": ",", "8": "-", "9": ".", "10": "/", "11": ";", "12": "<", "13": ">", "14": "?", "15": "[", "16": "\\", "17": "]", "18": "{", "19": "~", "20": "·", "21": "́", "22": "̂", "23": "̈", "24": "̊", "25": "̌", "26": "̓", "27": "̔", "28": "̣", "29": "͂", "30": "͜", "31": "Ͱ", "32": "ͱ", "33": "Ͳ", "34": "ͳ", "35": "͵", "36": "Ͷ", "37": "ͷ", "38": "΄", "39": "Ά", "40": "Έ", "41": "Ή", "42": "Ί", "43": "Ό", "44": "Ύ", "45": "Ώ", "46": "ΐ", "47": "Α", "48": "Β", "49": "Γ", "50": "Δ", "51": "Ε", "52": "Ζ", "53": "Η", "54": "Θ", "55": "Ι", "56": "Κ", "57": "Λ", "58": "Μ", "59": "Ν", "60": "Ξ", "61": "Ο", "62": "Π", "63": "Ρ", "64": "Σ", "65": "Τ", "66": "Υ", "67": "Φ", "68": "Χ", "69": "Ψ", "70": "Ω", "71": "Ϊ", "72": "ά", "73": "έ", "74": "ή", "75": "ί", "76": "ΰ", "77": "α", "78": "β", "79": "γ", "80": "δ", "81": "ε", "82": "ζ", "83": "η", "84": "θ", "85": "ι", "86": "κ", "87": "λ", "88": "μ", "89": "ν", "90": "ξ", "91": "ο", "92": "π", "93": "ρ", "94": "ς", "95": "σ", "96": "τ", "97": "υ", "98": "φ", "99": "χ", "100": "ψ", "101": "ω", "102": "ϊ", "103": "ϋ", "104": "ό", "105": "ύ", "106": "ώ", "107": "Ϗ", "108": "ϐ", "109": "ϑ", "110": "ϖ", "111": "ϗ", "112": "Ϙ", "113": "ϙ", "114": "Ϛ", "115": "ϛ", "116": "Ϝ", "117": "ϝ", "118": "Ϟ", "119": "ϟ", "120": "Ϡ", "121": "ϡ", "122": "ϰ", "123": "ϲ", "124": "Ϲ", "125": "Ϻ", "126": "ϻ", "127": "ἀ", "128": "ἁ", "129": "ἂ", "130": "ἃ", "131": "ἄ", "132": "ἅ", "133": "ἆ", "134": "ἇ", "135": "Ἀ", "136": "Ἁ", "137": "Ἄ", "138": "Ἅ", "139": "Ἆ", "140": "Ἇ", "141": "ἐ", "142": "ἑ", "143": "ἒ", "144": "ἓ", "145": "ἔ", "146": "ἕ", "147": "Ἐ", "148": "Ἑ", "149": "Ἒ", "150": "Ἓ", "151": "Ἔ", "152": "Ἕ", "153": "ἠ", "154": "ἡ", "155": "ἢ", "156": "ἤ", "157": "ἥ", "158": "ἦ", "159": "ἧ", "160": "Ἠ", "161": "Ἡ", "162": "Ἢ", "163": "Ἤ", "164": "Ἥ", "165": "Ἦ", "166": "Ἧ", "167": "ἰ", "168": "ἱ", "169": "ἲ", "170": "ἴ", "171": "ἵ", "172": "ἶ", "173": "ἷ", "174": "Ἰ", "175": "Ἱ", "176": "Ἲ", "177": "Ἳ", "178": "Ἴ", "179": "Ἵ", "180": "Ἶ", "181": "Ἷ", "182": "ὀ", "183": "ὁ", "184": "ὂ", "185": "ὃ", "186": "ὄ", "187": "ὅ", "188": "Ὀ", "189": "Ὁ", "190": "Ὃ", "191": "Ὄ", "192": "Ὅ", "193": "ὐ", "194": "ὑ", "195": "ὒ", "196": "ὓ", "197": "ὔ", "198": "ὕ", "199": "ὖ", "200": "ὗ", "201": "Ὑ", "202": "Ὕ", "203": "ὠ", "204": "ὡ", "205": "ὢ", "206": "ὣ", "207": "ὤ", "208": "ὥ", "209": "ὦ", "210": "ὧ", "211": "Ὠ", "212": "Ὡ", "213": "Ὣ", "214": "Ὤ", "215": "Ὥ", "216": "Ὦ", "217": "Ὧ", "218": "ὰ", "219": "ὲ", "220": "ὴ", "221": "ὶ", "222": "ὸ", "223": "ὺ", "224": "ὼ", "225": "ᾀ", "226": "ᾁ", "227": "ᾄ", "228": "ᾅ", "229": "ᾆ", "230": "ᾇ", "231": "ᾈ", "232": "ᾍ", "233": "ᾐ", "234": "ᾑ", "235": "ᾔ", "236": "ᾕ", "237": "ᾖ", "238": "ᾗ", "239": "ᾠ", "240": "ᾤ", "241": "ᾦ", "242": "ᾧ", "243": "ᾨ", "244": "ᾳ", "245": "ᾴ", "246": "ᾶ", "247": "ᾷ", "248": "᾽", "249": "ῂ", "250": "ῃ", "251": "ῄ", "252": "ῆ", "253": "ῇ", "254": "῎", "255": "ῒ", "256": "ῖ", "257": "ῗ", "258": "ῢ", "259": "ῤ", "260": "ῥ", "261": "ῦ", "262": "ῧ", "263": "Ὺ", "264": "Ῥ", "265": "ῲ", "266": "ῳ", "267": "ῴ", "268": "ῶ", "269": "ῷ", "270": "῾", "271": "’", "272": "†", "273": "⟦", "274": "⟧"}}